УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/РасчетыСКлиентамиПланОплат/РасчетыСКлиентамиПланОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="194e6ba2-f81f-4128-b4a2-18ac3d8e1ac6">
  <name>РасчетыСКлиентамиПланОплат</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="0c020269-197c-4baa-b96a-ef3d55b47eb0">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d5432982-84c1-4017-a8da-f331c11ae016">
    <name>ОбъектРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f31bf804-96e4-43aa-8eac-99df2d240207">
    <name>ДатаПлановогоПогашения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="03952131-4728-44c8-afb9-b9d4eb6ef5db">
    <name>ДатаВозникновения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартКонечнаяДатаРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартДатаПродленияРезервов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартРезервЗаканчивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="025cec6b-a37b-4836-802d-b862a2c24680">
    <name>смартВидТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb1bda59-7ed7-46ee-9737-0e55e9b9f6e6">
    <name>смартНомерМашины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2b9ec282-ad92-44cb-b072-47a36f857325">
    <name>смартНомерПрицепа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1471b7a-c73b-41fd-afa0-58788430b04b">
    <name>смартФИОВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="33b186f2-2628-48f3-a24e-adfce58bd35d">
    <name>смартНомерСерияПаспортВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3e9aa296-d524-418d-84ab-e9bea83d77eb">
    <name>смартДатаВыдачиПаспортаВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2f61b178-446c-49e4-b3cd-cf9f1c061abf">
    <name>смартЖелаемаяДатаОтгрузкиАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="671c355b-5223-4837-980b-5f9cd7f8cc7d">
    <name>смартЖелаемоеВремяОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fbce0c46-a4a3-49a3-aca2-e423debd297a">
    <name>смартФИОВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e99f34bd-4d77-4c27-a9bd-de06fcacc876">
    <name>смартНомерСерияПаспортВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7ac5896-d91d-4ee4-93dc-84fb50a8fe9f">
    <name>смартДатаВыдачиПаспортаВторогоВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НачалоОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/CommonModules/смартАвторезервирование/Module.bsl
//++ смарт:Подкин #1137 18.08.2022 11:30:36
Функция смарт_ТекстЗапросаГрафики() Экспорт 
	
	//++ #1812 смарт: Ермаков 08.05.2024 / Проблема с авторезервированием
	// Оставляем для совместимости
	Возврат смартОбеспечение.РезервыКДатеПолучитьТекстЗапроса();
	//-- #1812 смарт: Ермаков 08.05.2024
	
	//++ #1672 смарт: Ермаков 15.03.2024 / Некорректно распределяются резервы при проведении Заказа поставщику
	Текст =
	"// Поступление
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаСобытия 				КАК ДатаПоступления,
	|	КоличествоИзЗаказовПриход 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ГрафикПоступленияТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	)
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоступления
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|// Отгрузка
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОтгрузки.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ГрафикОтгрузки.Регистратор 	КАК Документ,	
	|
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузки.Регистратор) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ГрафикОтгрузки.Регистратор
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузки.Регистратор.ДокументОснование) = ТИП(Документ.ЗаказКлиента) 
	|			  И НЕ ГрафикОтгрузки.Регистратор.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ГрафикОтгрузки.Регистратор.ДокументОснование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказКлиента,
	|	
	|	ГрафикОтгрузки.КоличествоИзЗаказовПриход + ГрафикОтгрузки.КоличествоНеобеспеченоПриход КАК Количество
	|
	|ПОМЕСТИТЬ ГрафикОтгрузкиДокументыВРегистре
	|ИЗ
	|	РегистрНакопления.ГрафикОтгрузкиТоваров.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	) КАК ГрафикОтгрузки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Объединение ниже включает в себя данные:
	|// - заказы клиентов, которые вне графика
	|// - заказы на перемещение, которые вне графика
	|// - заказы на сборку, которые вне графика
	|// - заказы на внутреннее потребление, которые вне грфика
	|
	|// заказы клиентов, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 		КАК ДатаОтгрузки,
	|	Остатки.ЗаказКлиента 	КАК Документ,
	|	Остатки.ЗаказКлиента 	КАК ЗаказКлиента,
	|	Остатки.ЗаказаноОстаток КАК Количество
	|ПОМЕСТИТЬ ГрафикОтгрузкиДокументыВнеРегистра
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(
	|			,
	|			НЕ ЗаказКлиента В (ВЫБРАТЬ ЗаказКлиента ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад
	|	) КАК Остатки
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК Заказы
	|	ПО
	|		Заказы.Ссылка = Остатки.ЗаказКлиента
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на перемещение, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 			КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаПеремещение 	КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаПеремещения.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаПеремещения.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 						КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
	|			,
	|			НЕ ЗаказНаПеремещение В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ЗаказНаПеремещение.СкладОтправитель = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказыНаПеремещения
	|	ПО
	|		ЗаказыНаПеремещения.Ссылка = Остатки.ЗаказНаПеремещение
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаПеремещения.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|	
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на сборку, которые вне графика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 			КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаСборку 		КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаСборку.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаСборку.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 						КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаСборку.Остатки(
	|			,
	|			НЕ ЗаказНаСборку В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ЗаказНаСборку.Склад = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаСборку
	|	ПО
	|		ЗаказыНаСборку.Ссылка = Остатки.ЗаказНаСборку
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаСборку.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0
	|	
	|ОБЪЕДИНИТЬ 
	|
	|// заказы на внутреннее потребление, которые вне грфика
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) 						КАК ДатаОтгрузки,
	|	Остатки.ЗаказНаВнутреннееПотребление 	КАК Документ,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказыНаВнутреннееПотребление.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	|			  И НЕ ЗаказыНаВнутреннееПотребление.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ЗаказыКлиентов.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	КОНЕЦ 									КАК ЗаказКлиента,
	|	
	|	Остатки.ЗаказаноОстаток 				КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыНаВнутреннееПотребление.Остатки(
	|			,
	|			НЕ ЗаказНаВнутреннееПотребление В (ВЫБРАТЬ Документ ИЗ ГрафикОтгрузкиДокументыВРегистре)
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Склад = &Склад	 
	|	) КАК Остатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаСборку КАК ЗаказыНаВнутреннееПотребление
	|	ПО
	|		ЗаказыНаВнутреннееПотребление.Ссылка = Остатки.ЗаказНаВнутреннееПотребление
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		ЗаказыКлиентов.Ссылка = ЗаказыНаВнутреннееПотребление.ДокументОснование
	|		
	|ГДЕ
	|	Остатки.ЗаказаноОстаток > 0 И Остатки.КОформлениюОстаток = 0	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Объединение ниже включает в себя данные:
	|// - документы по графику
	|// - документы вне графика
	|
	|// документы по графику
	|ВЫБРАТЬ
	|	ДатаОтгрузки 	КАК ДатаОтгрузки,
	|	Документ 		КАК Документ,
	|	ЗаказКлиента 	КАК ЗаказКлиента,
	|	Количество 		КАК Количество
	|ПОМЕСТИТЬ ГрафикОтгрузкиПолный
	|ИЗ 
	|	ГрафикОтгрузкиДокументыВРегистре
	|
	|ОБЪЕДИНИТЬ 
	|
	|// документы вне графика
	|ВЫБРАТЬ
	|	ДатаОтгрузки 	КАК ДатаОтгрузки,
	|	Документ 		КАК Документ,
	|	ЗаказКлиента 	КАК ЗаказКлиента,
	|	Количество 		КАК Количество
	|ИЗ 
	|	ГрафикОтгрузкиДокументыВнеРегистра
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Фильтрация общего перечня документов
	|ВЫБРАТЬ
	|	ГрафикОтгрузкиПолный.ДатаОтгрузки 			КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиПолный.Документ 				КАК Документ,
	|	ГрафикОтгрузкиПолный.ЗаказКлиента 			КАК ЗаказКлиента,
	|	ГрафикОтгрузкиПолный.Количество 			КАК Количество,
	|	ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) КАК ПроцентОплаты
	|ПОМЕСТИТЬ ГрафикОтгрузкиПредварительный
	|ИЗ
	|	ГрафикОтгрузкиПолный КАК ГрафикОтгрузкиПолный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	|	ПО
	|		НЕ ГрафикОтгрузкиПолный.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		И ЗаказыКлиентов.Ссылка = ГрафикОтгрузкиПолный.ЗаказКлиента 
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов
	|	ПО
	|		СостоянияЗаказов.Заказ = ГрафикОтгрузкиПолный.ЗаказКлиента		
	|
	|ГДЕ
	|	НЕ ЕСТЬNULL(ЗаказыКлиентов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.ПустаяСсылка))
	|			= ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Получаем минимальные даты оплат по заказа клиентов
	|ВЫБРАТЬ
	|	МИНИМУМ(ДатаВозникновения) 	КАК ДатаОплаты,
	|	ОбъектРасчетов 				КАК ЗаказКлиента,
	|	1 							КАК Приоритет
	|ПОМЕСТИТЬ ОплатыПриоритеты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Обороты(
	|			,
	|			,
	|			, 
	|			ОбъектРасчетов 
	|				В (ВЫБРАТЬ ЗаказКлиента ИЗ ГрафикОтгрузкиПредварительный)
	|			И НЕ ОбъектРасчетов = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	)
	|ГДЕ
	|	КОплатеРасход > 0
	|СГРУППИРОВАТЬ ПО
	|	ОбъектРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// Собираем результат
	|// Сортировка документов:
	|// - документы с приоритетом 1 сортируются по датам оплаты - кто первый оплатил, тот первый получает резерв
	|// - документы с приоритетом 2 сортируются по дате документа, обеспечиваются резервом по остаточному принципу
	|ВЫБРАТЬ
	|	ГрафикОтгрузкиПредварительный.ДатаОтгрузки 					КАК ДатаОтгрузки,
	|	ГрафикОтгрузкиПредварительный.Документ 						КАК Документ,
	|	ГрафикОтгрузкиПредварительный.ЗаказКлиента 					КАК ЗаказКлиента,
	|	ГрафикОтгрузкиПредварительный.Количество 					КАК Количество,
	|	ЕСТЬNULL(ОплатыПриоритеты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))	КАК ДатаОплаты,
	|	ДАТАВРЕМЯ(1, 1, 1)											КАК ДатаСдвига,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаПеремещение)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.СкладПолучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК СкладПолучательЗаказНаПеремещение,
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаСборку)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураЗаказНаСборку,	
	|	
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ГрафикОтгрузкиПредварительный.Документ) = ТИП(Документ.ЗаказНаСборку)
	|		ТОГДА ГрафикОтгрузкиПредварительный.Документ.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ХарактеристикаЗаказНаСборку,
	|
	|	ВЫБОР
	|		КОГДА НЕ ГрафикОтгрузкиПредварительный.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|		ТОГДА ГрафикОтгрузкиПредварительный.ПроцентОплаты <= &МинимальныйПроцентОплаты
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроцентОплатыНижеМинимального
	|		
	|ИЗ
	|	ГрафикОтгрузкиПредварительный КАК ГрафикОтгрузкиПредварительный
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОплатыПриоритеты КАК ОплатыПриоритеты
	|	ПО
	|		ОплатыПриоритеты.ЗаказКлиента = ГрафикОтгрузкиПредварительный.ЗаказКлиента
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ОплатыПриоритеты.Приоритет, 2) ВОЗР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОплатыПриоритеты.Приоритет, 2) = 1
	|		ТОГДА ЕСТЬNULL(ОплатыПриоритеты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ГрафикОтгрузкиПредварительный.Документ.Дата
	|	КОНЕЦ ВОЗР
	|";   
	//-- #1672 смарт: Ермаков 15.03.2024
	
	Возврат Текст;

КонецФункции //-- смарт:Подкин #1137 18.08.2022 11:30:36
